posts/1912-blogging-with-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-11 Wed 19:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blogging with emacs &amp; org-mode</title>
<meta name="generator" content="Org mode" />

<link rel='stylesheet' type='text/css' href='../css/style.css' />
<meta name='viewport' content='width=device-width, initial-scale=1.0' />

</head>
<body>
<div id="content">
<h1 class="title">Blogging with emacs &amp; org-mode
<br />
<span class="subtitle">aka blogging using my personal note taking system. 2 birds 1 stone</span>
</h1>

<div id="outline-container-org2a35bf0" class="outline-2">
<h2 id="org2a35bf0">Rationale</h2>
<div class="outline-text-2" id="text-org2a35bf0">
<p>
It's been around 3 years now (since 2016) that I'm using emacs, and mostly it was for the note taking in org-mode. I also wrote my thesis for my studies using org-mode. I think I spent quite a <b>lot</b> of time tweaking emacs/org-mode etc to manage this but at the end&#x2026; I learned some first things about emacs!
</p>

<p>
Fast forward in 2019, I'm using emacs to learn/program in <code>Clojure</code>, so at the end learning emacs really paid off. :)
But, I digress. This post is about the process to set up a blog using org-mode
</p>
</div>
</div>
<div id="outline-container-org9f3983e" class="outline-2">
<h2 id="org9f3983e">Exporting to html</h2>
<div class="outline-text-2" id="text-org9f3983e">
<p>
When you in an org-mode file just run
</p>
<ul class="org-ul">
<li><code>org-html-export-to-html</code></li>
</ul>

<p>
to get the html exported file
</p>
</div>
<div id="outline-container-orgdf0008b" class="outline-3">
<h3 id="orgdf0008b">Problem#1</h3>
<div class="outline-text-3" id="text-orgdf0008b">
<p class="verse">
Please install htmlize from <a href="https://github.com/hniksic/emacs-htmlize">https://github.com/hniksic/emacs-htmlize</a><br />
</p>

<p>
Solution
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">use-package</span> <span style="color: #fd971f;">htmlize</span>)
</pre>
</div>

<p>
Running again.. it works!
</p>
</div>
</div>
<div id="outline-container-org73252a4" class="outline-3">
<h3 id="org73252a4">Problem#2</h3>
<div class="outline-text-3" id="text-org73252a4">
<p>
I use a package called <code>hideshowvis</code> to hide/show blocks/fuctions (aka collapsing/expanding a code block)
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">use-package</span> <span style="color: #fd971f;">hideshow-org</span>
  <span style="color: #555556;">;; </span><span style="color: #555556;">https://github.com/shanecelis/hideshow-org</span>
  <span style="color: #fd971f;">:load-path</span> <span style="color: #e2c770;">"elisp/"</span>
  <span style="color: #fd971f;">:hook</span> (prog-mode . hs-org/minor-mode))

(<span style="color: #fb2874;">use-package</span> <span style="color: #fd971f;">hideshowvis</span>
  <span style="color: #555556;">;; </span><span style="color: #555556;">https://www.emacswiki.org/emacs/hideshowvis.el</span>
  <span style="color: #fd971f;">:load-path</span> <span style="color: #e2c770;">"elisp/"</span>
  <span style="color: #fd971f;">:hook</span> (prog-mode . hideshowvis-minor-mode))
</pre>
</div>

<p>
And, in my surprise, upon exporting some code blocks, the output would contain some weird things. For example, the above codeblock would look like
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">*hideshowvis*(<span style="color: #fb2874;">use-package</span> <span style="color: #fd971f;">hideshow-org</span>
               <span style="color: #555556;">;; </span><span style="color: #555556;">https://github.com/shanecelis/hideshow-org</span>
               <span style="color: #fd971f;">:load-path</span> <span style="color: #e2c770;">"elisp/"</span>
               <span style="color: #fd971f;">:hook</span> (prog-mode . hs-org/minor-mode))

*hideshowvis*(<span style="color: #fb2874;">use-package</span> <span style="color: #fd971f;">hideshowvis</span>
               <span style="color: #555556;">;; </span><span style="color: #555556;">https://www.emacswiki.org/emacs/hideshowvis.el</span>
               <span style="color: #fd971f;">:load-path</span> <span style="color: #e2c770;">"elisp/"</span>
               <span style="color: #fd971f;">:hook</span> (prog-mode . hideshowvis-minor-mode))
</pre>
</div>

<p>
Upon googling, there is an issue in <a href="https://emacs.stackexchange.com/questions/50206/hideshowvis-text-shown-in-org-mode-source-code">stackoverflow</a> about this
</p>

<p>
Solution
</p>

<p>
In my configuration I add the <code>hideshowvis</code> in the prog-mode hook. I can see the hooks there
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">prog-mode-hook
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rainbow-delimiters-mode hideshowvis-minor-mode hs-org/minor-mode show-paren-mode)
</pre>
</div>

<p>
So.. why not just disable all these hooks? :)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">let</span> ((prog-mode-hook nil))
  (org-html-export-to-html))
</pre>
</div>

<p>
And it works! Wrapping it into a callable function
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">defun</span> <span style="color: #b6e63e;">my-export-to-html</span> ()
  (<span style="color: #fb2874;">interactive</span>)
  (<span style="color: #fb2874;">let</span> ((prog-mode-hook nil))
    (org-html-export-to-html)))
</pre>
</div>

<p>
By the way, this was my first stack overflow answer! :)
</p>
</div>
</div>
</div>
<div id="outline-container-org2277ef6" class="outline-2">
<h2 id="org2277ef6">Styling it</h2>
<div class="outline-text-2" id="text-org2277ef6">
<p>
Found some ideas in <a href="https://github.com/gongzhitaao/orgcss">https://github.com/gongzhitaao/orgcss</a> about styling. It's a work in progress though :)
</p>

<p>
The gist:
</p>
<ul class="org-ul">
<li><p>
add the following header in the org document
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #7f7f80;">#+HTML_HEAD: &lt;link rel="stylesheet" type="text/css" href="style.css"/&gt;</span>
</pre>
</div></li>
<li><p>
an example <code>style.css</code> file
</p>
<div class="org-src-container">
<pre class="src src-css"><span style="color: #b6e63e;">pre.src </span>{
    <span style="color: #fb2874;">overflow</span>: auto;
    <span style="color: #fb2874;">font-family</span>: monospace;
}

<span style="color: #555556;">/* </span><span style="color: #555556;">inline code =code= or ~code~ </span><span style="color: #555556;">*/</span>
:not(pre) &gt; code {
    <span style="color: #fb2874;">padding</span>: 2px 5px;
    <span style="color: #fb2874;">margin</span>: auto 1px;
    <span style="color: #fb2874;">border</span>: 1px solid <span style="color: #000000; background-color: #DDD;">#DDD</span>;
    <span style="color: #fb2874;">border-radius</span>: 3px;
    <span style="color: #fb2874;">background-clip</span>: padding-box;
    <span style="color: #fb2874;">color</span>: <span style="color: #ffffff; background-color: #333;">#333</span>;
}

<span style="color: #b6e63e;">body </span>{
    <span style="color: #fb2874;">max-width</span>: 750px;
    <span style="color: #fb2874;">margin</span>: 0 auto;
    <span style="color: #fb2874;">font-size</span>: 14px;
    <span style="color: #fb2874;">line-height</span>: 1.4em;
}
<span style="color: #fd971f;">@media</span> screen and (min-width: 600px) {
    <span style="color: #b6e63e;">body </span>{
        <span style="color: #fb2874;">font-size</span>: 18px;
    }
}

</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org7e15464" class="outline-2">
<h2 id="org7e15464"><span class="todo TODO">TODO</span> Adding comments 2</h2>
<div class="outline-text-2" id="text-org7e15464">
<p>
<a href="http://snarvaez.poweredbygnulinux.com/notes/org-mode-publishing-adding-disqus-code.html">http://snarvaez.poweredbygnulinux.com/notes/org-mode-publishing-adding-disqus-code.html</a>
Discuss seems to be the way to go for adding comments in pages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">defun</span> <span style="color: #b6e63e;">aod-org-export-filter</span> (output backend info)
  (<span style="color: #fb2874;">let*</span> ((output (replace-regexp-in-string  <span style="color: #e2c770;">"{{page_id}}"</span> page_id output))
         (output (replace-regexp-in-string  <span style="color: #e2c770;">"{{disqus_id}}"</span> disqus_id output))
         (output (replace-regexp-in-string  <span style="color: #e2c770;">"{{page_url}}"</span> page_url output)))
    output))

(<span style="color: #fb2874;">let*</span> ((org-export-global-macros '((<span style="color: #e2c770;">"title"</span> . <span style="color: #e2c770;">"my org title"</span>)))
       (prog-mode-hook nil) <span style="color: #555556;">;; </span><span style="color: #555556;">fixing interfering minor modes</span>
       (page_id <span style="color: #e2c770;">"1912-blogging-with-emacs"</span>)
       (page_url <span style="color: #e2c770;">"localhost"</span>)
       (disqus_id <span style="color: #e2c770;">"actondev-blog"</span>)
       (org-export-filter-final-output-functions
        '(aod-org-export-filter))
       )
  (org-html-export-to-html)
  )
</pre>
</div>

<p>
test here title Blogging with emacs &amp; org-mode
</p>

<ul class="org-ul">
<li>{{page<sub>url</sub>}}</li>
<li>{{page<sub>id</sub>}}</li>
<li>{{disqus<sub>id</sub>}}</li>
</ul>
</div>
</div>
<div id="outline-container-org62590b5" class="outline-2">
<h2 id="org62590b5">macros</h2>
<div class="outline-text-2" id="text-org62590b5">
<p>
<a href="https://bnolet.me/posts/2019/06/macros-in-org-mode/">https://bnolet.me/posts/2019/06/macros-in-org-mode/</a>
</p>
</div>
</div>
<div id="outline-container-org4903da3" class="outline-2">
<h2 id="org4903da3"></h2>
<div class="outline-text-2" id="text-org4903da3">
</div>
</div>
<div id="outline-container-org89d483d" class="outline-2">
<h2 id="org89d483d">Comments</h2>
<div class="outline-text-2" id="text-org89d483d">
<p>
Leave your comments below!
</p>
<div id="disqus_thread"></div>
<script>
  var disqus_config = function () {
  this.page.url = "";  // Replace PAGE_URL with your page's canonical URL variable
  this.page.identifier = "1912-blogging-with-emacs"; // Replace PAGE_IDENTIFIER with your page's unique identifier variable
  };
  
  (function() { // DON'T EDIT BELOW THIS LINE
  var d = document, s = d.createElement('script');
  s.src = 'https://actondev-blog.disqus.com/embed.js';
  s.setAttribute('data-timestamp', +new Date());
  (d.head || d.body).appendChild(s);
  })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>
</div>
</body>
</html>
